package Lecture._20210302;

public class Hello {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		System.out.println("Hello World!!!");
	}

}

// 1. 0부터 짝수를 더해서 합계가 100을 넘지 않는 마지막 짝수와 그 값까지 더한 합계를 한 줄씩 출력하세요.

// 2. 임의의 숫자로 로또 번호 6개를 출력하는 프로그램을 작성하시오.
//	1) 일반 java 프로그램
//	2) shuffle 알고리즘을 이용하여 작성 - 
//	3) Collection의 shuffle() 메소드를 이용하여 작성

// 3. 유원지에서 말을 태워주는데 처음 30분의 기본요금은 3000원이다.
//	  이후에는 10분당 500원의 추가요금을 다.
//	  말을 탄 시간(분)을 입력 받아서 전체 요금을 계산하는 프로그램을 작성하세요.
//	  (단, 1분이라도 시간 초과 시 10분 요금을 합니다.)

// 4. 배달 도시락을 주문하는데 10개까지는 개당 5000원이고
//	  10개를 초과하는 양에 대해서는 개당 4800원이다.
//	  배달 도시락의 주문 개수를 입력받아서 전체 금액을 계산하는 프로그램을 작성하시오.